#include "Sch.h"
#include "time.h"

//------------------------------------------------------------------------
//- 数据类型 sTask 和常数 SCH_MAX_TASKS 创建任务队列，被调度器引用
//------------------------------------------------------------------------
sTask SCH_tasks_G[SCH_MAX_TASKS];

//------------------------------------------------------------------------
//- 错误代码
//------------------------------------------------------------------------
tByte Error_code_G = 0;

/*************************************************************************
* Name: SCH_Init_TIM4
* Function: 准备调度器数据结构并且设置定时器中断（1ms）
* Input:
* Output:
*************************************************************************/
void SCH_Init_TIM4(void)
{
    tByte i;
    for (i = 0; i < SCH_MAX_TASKS; i++)
    {
        // 删除所有任务
        SCH_Delete_Task(i);
    }
    // 复位全局错误变量
    Error_code_G = 0;
    // 设置定时器，这里使用 TIM4
    TIM4_Init(4-1, 18000-1); // 1ms 定时器 TIM4 中断
}

/*************************************************************************
* Name: SCH_Delete_Task
* Function:
* Input:
* Output:
*************************************************************************/
void SCH_Delete_Task(tByte i)
{
    ;
}
